modm-ext/archive-stmicro-svd/header_stm32h745bgt6@m4.svd
        <register>
          <name>HUFFENC_AC1.27</name>
          <addressOffset>0x6cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.28</name>
          <addressOffset>0x6d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.29</name>
          <addressOffset>0x6d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.30</name>
          <addressOffset>0x6d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.31</name>
          <addressOffset>0x6dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.32</name>
          <addressOffset>0x6e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.33</name>
          <addressOffset>0x6e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.34</name>
          <addressOffset>0x6e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.35</name>
          <addressOffset>0x6ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.36</name>
          <addressOffset>0x6f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.37</name>
          <addressOffset>0x6f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.38</name>
          <addressOffset>0x6f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.39</name>
          <addressOffset>0x6fc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.40</name>
          <addressOffset>0x700</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.41</name>
          <addressOffset>0x704</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.42</name>
          <addressOffset>0x708</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.43</name>
          <addressOffset>0x70c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.44</name>
          <addressOffset>0x710</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.45</name>
          <addressOffset>0x714</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.46</name>
          <addressOffset>0x718</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.47</name>
          <addressOffset>0x71c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.48</name>
          <addressOffset>0x720</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.49</name>
          <addressOffset>0x724</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.50</name>
          <addressOffset>0x728</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.51</name>
          <addressOffset>0x72c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.52</name>
          <addressOffset>0x730</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.53</name>
          <addressOffset>0x734</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.54</name>
          <addressOffset>0x738</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.55</name>
          <addressOffset>0x73c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.56</name>
          <addressOffset>0x740</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.57</name>
          <addressOffset>0x744</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.58</name>
          <addressOffset>0x748</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.59</name>
          <addressOffset>0x74c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.60</name>
          <addressOffset>0x750</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.61</name>
          <addressOffset>0x754</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.62</name>
          <addressOffset>0x758</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.63</name>
          <addressOffset>0x75c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.64</name>
          <addressOffset>0x760</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.65</name>
          <addressOffset>0x764</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.66</name>
          <addressOffset>0x768</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.67</name>
          <addressOffset>0x76c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.68</name>
          <addressOffset>0x770</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.69</name>
          <addressOffset>0x774</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.70</name>
          <addressOffset>0x778</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.71</name>
          <addressOffset>0x77c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.72</name>
          <addressOffset>0x780</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.73</name>
          <addressOffset>0x784</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.74</name>
          <addressOffset>0x788</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.75</name>
          <addressOffset>0x78c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.76</name>
          <addressOffset>0x790</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.77</name>
          <addressOffset>0x794</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.78</name>
          <addressOffset>0x798</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.79</name>
          <addressOffset>0x79c</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.80</name>
          <addressOffset>0x7a0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.81</name>
          <addressOffset>0x7a4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.82</name>
          <addressOffset>0x7a8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.83</name>
          <addressOffset>0x7ac</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.84</name>
          <addressOffset>0x7b0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.85</name>
          <addressOffset>0x7b4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.86</name>
          <addressOffset>0x7b8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_AC1.87</name>
          <addressOffset>0x7bc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC0.0</name>
          <addressOffset>0x7c0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC0.1</name>
          <addressOffset>0x7c4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC0.2</name>
          <addressOffset>0x7c8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC0.3</name>
          <addressOffset>0x7cc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC0.4</name>
          <addressOffset>0x7d0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC0.5</name>
          <addressOffset>0x7d4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC0.6</name>
          <addressOffset>0x7d8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC0.7</name>
          <addressOffset>0x7dc</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC1.0</name>
          <addressOffset>0x7e0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC1.1</name>
          <addressOffset>0x7e4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC1.2</name>
          <addressOffset>0x7e8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC1.3</name>
          <addressOffset>0x7ec</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC1.4</name>
          <addressOffset>0x7f0</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC1.5</name>
          <addressOffset>0x7f4</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC1.6</name>
          <addressOffset>0x7f8</addressOffset>
          <size>0x20</size>
        </register>
        <register>
          <name>HUFFENC_DC1.7</name>
          <addressOffset>0x7fc</addressOffset>
          <size>0x20</size>
        </register>
